""" ИСХОДНЫЕ ДАННЫЕ
- Задание 2
- Кватернионы
- Вариант задания 1
- Орбита 2
"""
from typing import List

QUATERNION_0 = [0.632866, -0.1826981, 0.3653963, -0.657713]  # Безразмерная
ANGULAR_VELOCITY_0 = [1e-5, 1e-6, -1e-5]  # рад/с
SIGMA = 2  # угл.с ???
OMEGA_MAX = 628  # рад/с
L_MAX = 0.01  # Н * м
Jx = 1  # кг * м^2
Jy = 2  # кг * м^2
Jz = 1  # кг * м^2
J_efx = 1.6 * 1e-4  # кг * м^2

J: List[List[float]] = [
    [Jx, 0, 0],
    [0, Jy, 0],
    [0, 0, Jz]
]

J_ef: List[List[float]] = [
    [J_efx, 0, 0],
    [0, J_efx, 0],
    [0, 0, J_efx]
]

# Характеристики орбиты
# ---------------------
rx = -1195.712  # км
ry = -829.495  # км
rz = -6818.185  # км
Vx = 1.954065  # км/с
Vy = 7.195319  # км/с
Vz = -1.222097  # км/с
# ---------------------

r: List[float] = [rx, ry, rz]
V: List[float] = [Vx, Vy, Vz]
# A: List[float] = [.0, .0, .0]
